const miaoRouteRules = {
    help: /^(!|！|\/|#|＃)(喵喵|miao|miaomiao)(帮助|help|模块)$/,
    calendar: /^(!|！|\/|#|＃)(原神|星铁|绝区零)?(日历|素材日历|今日素材|明日素材)$/,
    profileList: /^(!|！|\/|#|＃)(原神|星铁)?(喵喵)?(面板|更新面板)(列表)?\s*(\d{9,10})?$/,
    profileDetail: /^(!|！|\/|#|＃)*(.{1,10})\s*(详细|面板|详情|面板详情|伤害)\s*(\d{9,10})?$/,
    artifactList: /^(!|！|\/|#|＃)(原神|星铁)?(圣遗物|遗器)(列表|总览)\s*(\d{9,10})?$/,
    trainingStat: /^(!|！|\/|#|＃)(原神|星铁)?(练度统计|练度|角色统计)\s*(\d{9,10})?$/,
    rankList: /^(!|！|\/|#|＃)(原神|星铁)?\s*(.{1,10})\s*(分|评分|圣遗物|遗器|双爆|双暴|ACE)?\s*(排名|排行)(榜)?$/,
    groupTop: /^(!|！|\/|#|＃)(原神|星铁)?\s*(群|群内)?\s*(最强|最高|极限|第一)\s*(.{1,10})$/,
    rankAdmin: /^(!|！|\/|#|＃)(原神|星铁)?\s*(开启|打开|启用|关闭|禁用|重置|重设|清空)\s*(排名|排行)$/,
    roleCombat: /^(!|！|\/|#|＃)(幻想真境剧诗|剧诗)$/,
    hardChallenge: /^(!|！|\/|#|＃)(幽境危战|幽境|危战)$/
};

export { miaoRouteRules };
